In [1]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import LabelEncoder

### ***Feature Engineering***

        ## - So far we have performed feature analysis

                    + Data frame qick check 
                    + cCategorical column analysis 
                    + Bar charts
                    + Pie charts
                    + Numerical column analysis 
                    + Histograms, box plots, outliers
                    + Bi - multi variate anaalysis
                    + correlation etc.

        ## - Noe we neeed ot learn Feature Engineering 

                    + we will create a new columns for better ML models 
                    + we will perform the ***Encoding***, which is convert categorical to numerical Data 
                    + we will do data **Transformation**
                    + we eill perform **Scaling : Standardization and Normalization**
                    + we wil perform **missing value analysis
        
        ## - Simply feature engineering means our data will be modified.

In [2]:
visa = pd.read_csv(r"C:\Users\prath\FullStackDataScience\my own folder\database\data_files\Visadataset.csv")
visa.head(3)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied

In [3]:
cat = visa.select_dtypes(include="str").columns.tolist()
num = visa.select_dtypes(exclude="str").columns.tolist()

In [4]:
cat

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'region_of_employment',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [5]:
num

['no_of_employees', 'yr_of_estab', 'prevailing_wage']

### ***Encoding***

            + Encoding means convert categorical data Numerical data 
            + ML/DL or any model works based on maths 
            + Models can not understand english caharaters 
            + so it is very important to convert categorical label to numerical values
            + For examples Gender columns has two tables

                        - Male 
                        - Female

            + Then Female represent as 0 and male represent as 1 based on alphabetical order.

In [6]:
## visa[case_status]

visa.case_status.unique()

<StringArray>
['Denied', 'Certified']
Length: 2, dtype: str

In [7]:
d = {
    "Certified" : 0,
    "Denied" : 1

}

visa["case_status"] = visa["case_status"].map(d)

In [8]:
visa

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,1
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,1
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,0
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,0
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,0
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,0
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,0

In [9]:
## for continent column :

con = visa.continent.unique().tolist()

continent = { con[i] : i  for i in range(len(con))}

In [10]:
visa['continent'] = visa['continent'].map(continent)

In [11]:
visa

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,0,High School,N,N,14513,2007,West,592.2029,Hour,Y,1
1,EZYV02,0,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0
2,EZYV03,0,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1
3,EZYV04,0,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,1
4,EZYV05,1,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,0,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,0
25476,EZYV25477,0,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,0
25477,EZYV25478,0,Master's,Y,N,1121,1910,South,146298.8500,Year,N,0
25478,EZYV25479,0,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,0
25479,EZYV25480,0,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,0

In [12]:
l = visa.continent.unique().tolist()
visa["continent"] = visa["continent"].map({l[i] : i for i in range(len(visa.continent.unique().tolist()))})

In [13]:
for i in cat[1:] : 
    l = visa[i].unique().tolist()
    visa[i] = visa[i].map({l[i] : i for i in range(len(l))})
    
visa

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,0,0,0,0,14513,2007,0,592.2029,0,0,0
1,EZYV02,0,1,1,0,2412,2002,1,83425.6500,1,0,1
2,EZYV03,0,2,0,1,44444,2008,0,122996.8600,1,0,0
3,EZYV04,0,2,0,0,98,1897,0,83434.0300,1,0,0
4,EZYV05,1,1,1,0,1082,2005,2,149907.3900,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,0,2,1,1,2601,2008,2,77092.5700,1,0,1
25476,EZYV25477,0,0,1,0,3274,2006,1,279174.7900,1,0,1
25477,EZYV25478,0,1,1,0,1121,1910,2,146298.8500,1,1,1
25478,EZYV25479,0,1,1,1,1918,1887,0,86154.7700,1,0,1
25479,EZYV25480,0,2,1,0,3195,1960,3,70876.9100,1,0,1

In [14]:
visa = pd.read_csv(r"C:\Users\prath\FullStackDataScience\my own folder\database\data_files\Visadataset.csv")
visa.head(3)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied

### ****Encoding and Sklearn****

- we have encoded categoriccal data ta numerical using scratch.

- but the same way we can change uning the inbuild ***package***.

- Name of the package is : **scikit - learn** aka ***sklearn***

- It is a heart of ML 

- 99% of ALL ML are under Sklearn package.

- package name : Sklearn 

        + Module name : preprocessing 

            --> class : LabelEncoder

                |
                --> Methods : 

                                1. fit

                                2. transform 

                                3. fit_transform

- while do the encoding 

        - we created a dictionary 

        - we use the dictionary on original data, the data become Encoded.

        - ***The Data Changed***

    -+> *CREATE* and *MODIFY* 

        - CREATE  means : fit, MODIFY means : Transform

In [15]:
visa.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='str')

In [16]:
visa.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [17]:
visa.info()

<class 'pandas.DataFrame'>
RangeIndex: 25480 entries, 0 to 25479
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   case_id                25480 non-null  str
 1   continent              25480 non-null  str
 2   education_of_employee  25480 non-null  str
 3   has_job_experience     25480 non-null  str
 4   requires_job_training  25480 non-null  str
 5   no_of_employees        25480 non-null  int64
 6   yr_of_estab            25480 non-null  int64
 7   region_of_employment   25480 non-null  str
 8   prevailing_wage        25480 non-null  float64
 9   unit_of_wage           25480 non-null  str
 10  full_time_position     25480 non-null  str
 11  case_status            25480 non-null  str
dtypes: float64(1), int64(2), str(9)
memory usage: 2.3 MB

In [18]:
cat = visa.select_dtypes(include = "str").columns.tolist()
cat

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'region_of_employment',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [19]:
# from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()

for i in cat[1:] :

    visa[i] = le.fit_transform(visa[i])

visa

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,2,0,0,14513,2007,4,592.2029,0,1,1
1,EZYV02,1,3,1,0,2412,2002,2,83425.6500,3,1,0
2,EZYV03,1,0,0,1,44444,2008,4,122996.8600,3,1,1
3,EZYV04,1,0,0,0,98,1897,4,83434.0300,3,1,1
4,EZYV05,0,3,1,0,1082,2005,3,149907.3900,3,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,0,1,1,2601,2008,3,77092.5700,3,1,0
25476,EZYV25477,1,2,1,0,3274,2006,2,279174.7900,3,1,0
25477,EZYV25478,1,3,1,0,1121,1910,3,146298.8500,3,0,0
25478,EZYV25479,1,3,1,1,1918,1887,4,86154.7700,3,1,0
25479,EZYV25480,1,0,1,0,3195,1960,1,70876.9100,3,1,0

In [20]:
visa["case_status"] = le.inverse_transform(visa["case_status"])

In [21]:
visa

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,2,0,0,14513,2007,4,592.2029,0,1,Denied
1,EZYV02,1,3,1,0,2412,2002,2,83425.6500,3,1,Certified
2,EZYV03,1,0,0,1,44444,2008,4,122996.8600,3,1,Denied
3,EZYV04,1,0,0,0,98,1897,4,83434.0300,3,1,Denied
4,EZYV05,0,3,1,0,1082,2005,3,149907.3900,3,1,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,0,1,1,2601,2008,3,77092.5700,3,1,Certified
25476,EZYV25477,1,2,1,0,3274,2006,2,279174.7900,3,1,Certified
25477,EZYV25478,1,3,1,0,1121,1910,3,146298.8500,3,0,Certified
25478,EZYV25479,1,3,1,1,1918,1887,4,86154.7700,3,1,Certified
25479,EZYV25480,1,0,1,0,3195,1960,1,70876.9100,3,1,Certified

### *****One hot Encoder*****

- ***Curse of the dimensionality***

        - more labels --> more dimensions --> more process the data --> more time and more memory



- |Relationship|
-               1. X1 to X1 : Auto Corelation
                2. X1 to X2 : Multi Colinearity 
                3. X1 to y :  Corelation 




        + Order 

                    - We Don't Want Relation between two input columns 

                    - the TWO COLUMNS SHOULD BE INDEPENDENT TO EACH OTHER

                    -           PERPENDICULAR


                    - 90 DEGREES PHASE SHIFT 


                    - COS AND SIN 90 
                            COS90 == SIN0 == 0 

                    
                    
            - THIS IS CALLED ORTHOGONALITY

In [22]:
visa

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,2,0,0,14513,2007,4,592.2029,0,1,Denied
1,EZYV02,1,3,1,0,2412,2002,2,83425.6500,3,1,Certified
2,EZYV03,1,0,0,1,44444,2008,4,122996.8600,3,1,Denied
3,EZYV04,1,0,0,0,98,1897,4,83434.0300,3,1,Denied
4,EZYV05,0,3,1,0,1082,2005,3,149907.3900,3,1,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,0,1,1,2601,2008,3,77092.5700,3,1,Certified
25476,EZYV25477,1,2,1,0,3274,2006,2,279174.7900,3,1,Certified
25477,EZYV25478,1,3,1,0,1121,1910,3,146298.8500,3,0,Certified
25478,EZYV25479,1,3,1,1,1918,1887,4,86154.7700,3,1,Certified
25479,EZYV25480,1,0,1,0,3195,1960,1,70876.9100,3,1,Certified

#### ***to change the columns for making the columns to give numnerical to give to the machine***

In [23]:
visa = pd.read_csv(r"C:\Users\prath\FullStackDataScience\my own folder\database\data_files\Visadataset.csv")
visa.head(3)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied

In [24]:
cat = visa.select_dtypes(include = "str").columns.tolist()

In [25]:
pd.get_dummies(visa, columns=cat[1:], dtype=int)

,case_id,no_of_employees,yr_of_estab,prevailing_wage,continent_Africa,continent_Asia,continent_Europe,continent_North America,continent_Oceania,continent_South America,...,region_of_employment_South,region_of_employment_West,unit_of_wage_Hour,unit_of_wage_Month,unit_of_wage_Week,unit_of_wage_Year,full_time_position_N,full_time_position_Y,case_status_Certified,case_status_Denied
0,EZYV01,14513,2007,592.2029,0,1,0,0,0,0,...,0,1,1,0,0,0,0,1,0,1
1,EZYV02,2412,2002,83425.6500,0,1,0,0,0,0,...,0,0,0,0,0,1,0,1,1,0
2,EZYV03,44444,2008,122996.8600,0,1,0,0,0,0,...,0,1,0,0,0,1,0,1,0,1
3,EZYV04,98,1897,83434.0300,0,1,0,0,0,0,...,0,1,0,0,0,1,0,1,0,1
4,EZYV05,1082,2005,149907.3900,1,0,0,0,0,0,...,1,0,0,0,0,1,0,1,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,2601,2008,77092.5700,0,1,0,0,0,0,...,1,0,0,0,0,1,0,1,1,0
25476,EZYV25477,3274,2006,279174.7900,0,1,0,0,0,0,...,0,0,0,0,0,1,0,1,1,0
25477,EZYV25478,1121,1910,146298.8500,0,1,0,0,0,0,...,1,0,0,0,0,1,1,0,1,0
25478,EZYV25479,1918,1887,86154.7700,0,1,0,0,0,0,...,0,1,0,0,0,1,0,1,1,0
25479,EZYV25480,3195,1960,70876.9100,0,1,0,0,0,0,...,0,0,0,0,0,1,0,1,1,0